package 인터페이스기초;

public class git {

	public static void main(String[] args) {
		
		//GIT
//		-컴퓨터 파일의 변경사항 추적, 여러명의 사용자들 간에 해당 파일들을 작업을 조율하기 위한 분산버전 관리 시스템
		//GITHUB
//		-GIT저장소 호스팅을 지원하는 간에 웹서비스, 온라인 상에서 여러 사용자들이 컴퓨터 파일을 공유할 수 있다.
		
//		- 충돌을 방지하고 효율적으로 처리하는 방식이 중요하다
//		- 소스 코드를 주고 받을 필요 없이 병렬 개발 가능
//		- 프로젝트를 관리, 배포, 이슈추적(Error전) 등 편리한 기능 지원
//		- repository: 각 운영 되는 단위
//		- Push : 업로드
//		- pull : 다운로드
		
//		# pull -> push 원칙!
		
		# 구글 -> 깃허브 링크를 통한 관리!
		

	}

}
